{
  "PIP+ mammary luminal cell": "cell type: PIP+ mammary luminal cell. a luminal epithelial cell subtype from mammary tissue.",
  "Endothelial": "cell type: Endothelial. a vascular endothelial cell involved in angiogenesis.",
  "Cycling lactocyte": "cell type: Cycling lactocyte. a lactocyte likely undergoing active cell division.",
  "Tumour-associated macrophage": "cell type: Tumour-associated macrophage. a macrophage found within the tumor microenvironment with immune-modulating roles.",
  "Secretoglobin mammary luminal cell": "cell type: Secretoglobin mammary luminal cell. a luminal epithelial cell subtype that expresses secretoglobins.",
  "Mammary basal cell": "cell type: Mammary basal cell. a basal epithelial cell from the mammary gland.",
  "SAA2+ mammary luminal progenitor": "cell type: SAA2+ mammary luminal progenitor. a progenitor luminal epithelial cell subtype from mammary tissue expressing SAA2.",
  "Fibroblast": "cell type: Fibroblast. a stromal cell involved in extracellular matrix production and tissue structure.",
  "Regulatory T cell": "cell type: Regulatory T cell. an immune cell involved in suppressing immune responses and maintaining tolerance.",
  "CD4+ T cell": "cell type: CD4+ T cell. a helper T cell coordinating immune responses.",
  "Pericyte": "cell type: Pericyte. a perivascular stromal cell that stabilizes blood vessels and regulates blood flow.",
  "Macrophage": "cell type: Macrophage. a myeloid immune cell involved in phagocytosis and antigen presentation.",
  "cDC": "cell type: cDC. a conventional dendritic cell specialized in antigen presentation.",
  "Cancer-associated fibroblast": "cell type: Cancer-associated fibroblast. a fibroblast in the tumor microenvironment supporting tumor progression.",
  "NK/CD8+ T cell": "cell type: NK/CD8+ T cell. a cytotoxic immune cell involved in killing infected or malignant cells.",
  "pDC": "cell type: pDC. a plasmacytoid dendritic cell involved in type I interferon production.",
  "SCGB3A1+ mammary luminal progenitor": "cell type: SCGB3A1+ mammary luminal progenitor. a luminal progenitor cell subtype expressing SCGB3A1.",
  "Cycling mammary luminal progenitor": "cell type: Cycling mammary luminal progenitor. a dividing luminal progenitor cell subtype from mammary tissue.",
  "Plasma cell": "cell type: Plasma cell. a B-cell-derived immune cell specialized in antibody secretion.",
  "B cell": "cell type: B cell. an immune cell that can differentiate into plasma cells to produce antibodies.",
  "Mast cell": "cell type: Mast cell. an immune cell involved in allergic and inflammatory responses.",
  "Tumor cell": "cell type: Tumor cell. a malignant cell with uncontrolled growth and cancerous behavior, commonly found in tumors.",
  "Transformed epithelial cell": "cell type: Transformed epithelial cell. an epithelial cell with oncogenic alterations and malignant characteristics.",
  "Malignant luminal cell": "cell type: Malignant luminal cell. a luminal epithelial cell derived from breast tissue that exhibits cancer-associated features.",
  "Tumor-associated endothelial cell": "cell type: Tumor-associated endothelial cell. an endothelial cell influenced by tumor signals, supporting neovascularization.",
  "Tumor-infiltrating immune cell": "cell type: Tumor-infiltrating immune cell. an immune cell within the tumor microenvironment, playing roles in tumor defense or tolerance."
}
